In [17]:
import sqlite3
import pandas as pd
import numpy as np

In [18]:
# Load CSV
df = pd.read_csv("C:/Users/User/OneDrive/Desktop/DA Intern @ ApexPlanet/Task - 2/Walmart_Sales.csv")

# Show first few rows
df.head()

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.50,2.625,211.350143,8.106

In [19]:
# Convert date from DD-MM-YYYY format
df['Date'] = pd.to_datetime(df['Date'], format="%d-%m-%Y")

# Additional useful columns
df['Month'] = df['Date'].dt.month
df['Year']  = df['Date'].dt.year
df['Week']  = df['Date'].dt.isocalendar().week

df.head()

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment,Month,Year,Week
0,1,2010-02-05,1643690.90,0,42.31,2.572,211.096358,8.106,2,2010,5
1,1,2010-02-12,1641957.44,1,38.51,2.548,211.242170,8.106,2,2010,6
2,1,2010-02-19,1611968.17,0,39.93,2.514,211.289143,8.106,2,2010,7
3,1,2010-02-26,1409727.59,0,46.63,2.561,211.319643,8.106,2,2010,8
4,1,2010-03-05,1554806.68,0,46.50,2.625,211.350143,8.106,3,2010,9

In [20]:
# Create a new connection (in-memory database)
conn = sqlite3.connect(":memory:")

# Load dataframe into SQL table
df.to_sql("walmart", conn, index=False, if_exists='replace')

print("SQL table 'walmart' created successfully!")

SQL table 'walmart' created successfully!

In [21]:
query1 = """
SELECT Store, SUM(Weekly_Sales) AS Total_Sales
FROM walmart
GROUP BY Store
ORDER BY Total_Sales DESC;
"""

pd.read_sql_query(query1, conn)

    Store   Total_Sales
0      20  3.013978e+08
1       4  2.995440e+08
2      14  2.889999e+08
3      13  2.865177e+08
4       2  2.753824e+08
5      10  2.716177e+08
6      27  2.538559e+08
7       6  2.237561e+08
8       1  2.224028e+08
9      39  2.074455e+08
10     19  2.066349e+08
11     31  1.996139e+08
12     23  1.987506e+08
13     24  1.940160e+08
14     11  1.939628e+08
15     28  1.892637e+08
16     41  1.813419e+08
17     32  1.668192e+08
18     18  1.551147e+08
19     22  1.470756e+08
20     12  1.442872e+08
21     26  1.434164e+08
22     34  1.382498e+08
23     40  1.378703e+08
24     35  1.315207e+08
25      8  1.299512e+08
26     17  1.277821e+08
27     45  1.123953e+08
28     21  1.081179e+08
29     25  1.010612e+08
30     43  9.056544e+07
31     15  8.913368e+07
32      7  8.159828e+07
33     42  7.956575e+07
34      9  7.778922e+07
35     29  7.714155e+07
36     16  7.425243e+07
37     37  7.420274e+07
38     30  6.271689e+07
39      3  5.758674e+07
40     38  5.515963e+07
41     36  5.341221e+07
42      5  4.547569e+07
43     44  4.329309e+07
44     33  3.716022e+07

In [22]:
query2 = """
SELECT strftime('%m', Date) AS Month,
       AVG(Weekly_Sales) AS Avg_Sales
FROM walmart
GROUP BY Month
ORDER BY Avg_Sales DESC;
"""

pd.read_sql_query(query2, conn)

   Month     Avg_Sales
0     12  1.281864e+06
1     11  1.147266e+06
2     06  1.064325e+06
3     02  1.053200e+06
4     08  1.048017e+06
5     07  1.031748e+06
6     05  1.031714e+06
7     04  1.026762e+06
8     03  1.013309e+06
9     10  9.996321e+05
10    09  9.893353e+05
11    01  9.238846e+05

In [23]:
query3 = """
SELECT Holiday_Flag,
       AVG(Weekly_Sales) AS Avg_Sales
FROM walmart
GROUP BY Holiday_Flag;
"""

pd.read_sql_query(query3, conn)

   Holiday_Flag     Avg_Sales
0             0  1.041256e+06
1             1  1.122888e+06

In [24]:
query4 = """
SELECT Date, Store, Weekly_Sales
FROM walmart
ORDER BY Weekly_Sales DESC
LIMIT 10;
"""

pd.read_sql_query(query4, conn)

                  Date  Store  Weekly_Sales
0  2010-12-24 00:00:00     14    3818686.45
1  2010-12-24 00:00:00     20    3766687.43
2  2010-12-24 00:00:00     10    3749057.69
3  2011-12-23 00:00:00      4    3676388.98
4  2010-12-24 00:00:00     13    3595903.20
5  2011-12-23 00:00:00     13    3556766.03
6  2011-12-23 00:00:00     20    3555371.03
7  2010-12-24 00:00:00      4    3526713.39
8  2011-12-23 00:00:00     10    3487986.89
9  2010-12-24 00:00:00      2    3436007.68

In [25]:
query5 = """
SELECT Fuel_Price,
       AVG(Weekly_Sales) AS Avg_Sales
FROM walmart
GROUP BY Fuel_Price
ORDER BY Fuel_Price;
"""

pd.read_sql_query(query5, conn)

     Fuel_Price     Avg_Sales
0         2.472  4.702810e+05
1         2.513  4.344714e+05
2         2.514  1.015099e+06
3         2.520  4.475194e+05
4         2.533  4.312945e+05
..          ...           ...
887       4.294  8.758470e+05
888       4.301  8.531141e+05
889       4.308  8.875630e+05
890       4.449  8.440218e+05
891       4.468  8.659708e+05

[892 rows x 2 columns]

In [26]:
query6 = """
SELECT strftime('%Y', Date) AS Year,
       SUM(Weekly_Sales) AS Total_Sales
FROM walmart
GROUP BY Year
ORDER BY Year;
"""

pd.read_sql_query(query6, conn)

   Year   Total_Sales
0  2010  2.288886e+09
1  2011  2.448200e+09
2  2012  2.000133e+09

In [27]:
query7 = """
SELECT CPI,
       AVG(Weekly_Sales) AS Avg_Sales
FROM walmart
GROUP BY CPI
ORDER BY CPI;
"""

pd.read_sql_query(query7, conn)

             CPI     Avg_Sales
0     126.064000  1.016970e+06
1     126.076645  1.021504e+06
2     126.085452  1.056102e+06
3     126.089290  9.676731e+05
4     126.101935  1.040635e+06
...          ...           ...
2140  227.018417  9.003098e+05
2141  227.036936  8.916714e+05
2142  227.169392  5.584648e+05
2143  227.214288  5.420095e+05
2144  227.232807  5.497315e+05

[2145 rows x 2 columns]

In [28]:
query8 = """
SELECT Store, strftime('%Y', Date) AS Year,
       SUM(Weekly_Sales) AS Total_Sales
FROM walmart
GROUP BY Store, Year
ORDER BY Store, Year;
"""

pd.read_sql_query(query8, conn)

     Store  Year  Total_Sales
0        1  2010  73278832.00
1        1  2011  80921918.83
2        1  2012  68202058.02
3        2  2010  95277864.19
4        2  2011  98607881.42
..     ...   ...          ...
130     44  2011  15498194.67
131     44  2012  14187373.72
132     45  2010  38536343.37
133     45  2011  41135367.88
134     45  2012  32723630.17

[135 rows x 3 columns]